Core/src/Documents/AzRyКонвертацияВалюты/AzRyКонвертацияВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AzRyКонвертацияВалюты</name>
  <registerRecords>AccumulationRegister.ПлатежныйКалендарь</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет1</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Касса1</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет2</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Касса2</name>
    <type>
      <types>CatalogRef.Кассы</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДатаКурсаВалюты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Валюта1</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Валюта2</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийРасходСоСчета</types>
      <types>EnumRef.AzRyВидыОперацийКонвертацияВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаОпераций</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеКонвертаций</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДебетРасход</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКредитПриход</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипыКонвертацияВалюты</name>
    <type>
      <types>EnumRef.AzRyТипыКонвертацияВалюты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyJiraCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>Статья</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
</mdclass:Document>

Core/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>ОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>НеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>НаЭкспорт</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/AzRyТипыКонвертацияВалюты/AzRyТипыКонвертацияВалюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AzRyТипыКонвертацияВалюты</name>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/AzRyКонвертацияВалюты/Forms/ФормаДокумента/Module.bsl
//////////////////////////////////////////////////////////////////////////////////
//// ПЕРЕМЕННЫЕ МОДУЛЯ

//&НаКлиенте
//Перем НаправлениеКонвертаций;

//////////////////////////////////////////////////////////////////////////////////
//// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

//// Очистить дату курса
//&НаСервере
//Функция ОчиститьДатуКурса()

//	Объект.ДатаКурсаВалюты = Неопределено;
//	Объект.Курс = Неопределено;
//	Объект.Кратность = Неопределено;

//КонецФункции // ОчиститьДатуКурса()
// 

//// Функция - ДатаКурсаВалютыПриИзмененииСервер
////
//&НаСервере
//Функция ДатаКурсаВалютыПриИзмененииСервер()

//	СтруктураКурс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаОпераций, Объект.Дата);
//	
//	Объект.Курс      = СтруктураКурс.Курс;
//	Объект.Кратность = СтруктураКурс.Кратность;
//	
//КонецФункции // ДатаКурсаВалютыПриИзмененииСервер()

//// Функция - БанковскийСчет1ПриИзмененииСервер
//&НаСервере
//Функция БанковскийСчет1ПриИзмененииСервер1()
//	
//	ВалютаУчета = Константы.ВалютаУчета.Получить();
//	
//	Если Не Объект.БанковскийСчет1.ВалютаДенежныхСредств = ВалютаУчета Тогда 
//		Объект.ВалютаОпераций = Объект.БанковскийСчет1.ВалютаДенежныхСредств;
//	КонецЕсли;	

//	Объект.Сумма1 = 0;
//	
//	//Объект.Валюта1 = Объект.БанковскийСчет1.ВалютаДенежныхСредств;
//		
//КонецФункции // БанковскийСчет1ПриИзмененииСервер()

//// Функция - БанковскийСчет2ПриИзмененииСервер
//&НаСервере
//Функция БанковскийСчет2ПриИзмененииСервер1()
//	
//	ВалютаУчета = Константы.ВалютаУчета.Получить();
//	
//	Если Не Объект.БанковскийСчет2.ВалютаДенежныхСредств = ВалютаУчета Тогда 
//		Объект.ВалютаОпераций = Объект.БанковскийСчет2.ВалютаДенежныхСредств;
//	КонецЕсли;	

//	Объект.Сумма2 = 0;
//	
//	//Объект.Валюта2 = Объект.БанковскийСчет2.ВалютаДенежныхСредств;
//	
//КонецФункции // БанковскийСчет1ПриИзмененииСервер()

//// Функция - БанковскийСчетПриИзмененииСервер
//&НаСервере
//Функция БанковскийСчет1ПриИзмененииСервер()
//			
//	Если Объект.БанковскийСчет1.ВалютаДенежныхСредств = Константы.ВалютаУчета.Получить() Тогда 
//		Объект.НаправлениеКонвертаций = "Конверт_ВалютаУчета_ПроизволнаяВалюта";
//		Возврат "Конверт_ВалютаУчета_ПроизволнаяВалюта";
//	Иначе 
//		Объект.НаправлениеКонвертаций = "Конверт_ПроизволнаяВалюта_ВалютаУчета";
//		Возврат "Конверт_ПроизволнаяВалюта_ВалютаУчета";
//	КонецЕсли;	
//		
//КонецФункции

//// Функция - БанковскийСчет2ПриИзмененииСервер
//&НаСервере
//Функция БанковскийСчет2ПриИзмененииСервер()
//			
//	Если Объект.БанковскийСчет2.ВалютаДенежныхСредств = Константы.ВалютаУчета.Получить() Тогда 
//		Объект.НаправлениеКонвертаций = "Конверт_ПроизволнаяВалюта_ВалютаУчета"; 
//		Возврат "Конверт_ПроизволнаяВалюта_ВалютаУчета";
//	Иначе 
//		Объект.НаправлениеКонвертаций = "Конверт_ВалютаУчета_ПроизволнаяВалюта";
//		Возврат "Конверт_ВалютаУчета_ПроизволнаяВалюта";
//	КонецЕсли;	
//		
//КонецФункции


//// Функция - ПолучитьТекстВалютыБанкСчет1
//&НаСервере
//Функция ПолучитьТекстВалютыБанкСчет1()

//	Если ЗначениеЗаполнено(Объект.БанковскийСчет1) Тогда 
//		Возврат " (" + Объект.БанковскийСчет1.ВалютаДенежныхСредств.Наименование + ") ";
//	Иначе 	
//		Возврат "";
//	КонецЕсли;

//КонецФункции // ПолучитьТекстВалютыБанкСчет1()

//// ПолучитьТекстВалютыБанкСчет2
//&НаСервере
//Функция ПолучитьТекстВалютыБанкСчет2()

//	Если ЗначениеЗаполнено(Объект.БанковскийСчет2) Тогда 
//		Возврат " (" + Объект.БанковскийСчет2.ВалютаДенежныхСредств.Наименование + ") ";
//	Иначе 	
//		Возврат "";
//	КонецЕсли;

//КонецФункции // ПолучитьТекстВалютыБанкСчет1()

//// Процедура - УправлениеВыдимостьиРекБанкСчет2
//&НаКлиенте
//Процедура УправлениеВидимостьиРекБанкСчет2()

//	Если ЗначениеЗаполнено(Элементы.БанковскийСчет1.ТекстРедактирования) Тогда 
//		Элементы.БанковскийСчет2.Доступность = Истина;
//		Элементы.Сумма2.Доступность          = Истина;
//	Иначе 
//		Элементы.БанковскийСчет2.Доступность = Ложь;
//		Элементы.Сумма2.Доступность          = Ложь;	
//	КонецЕсли;
//	
//КонецПроцедуры // УправлениеВыдимостьиРекБанкСчет2()

//// Процедура - СуммаДокументаПриИзмененииСервер
//&НаСервере
//Процедура СуммаДокументаПриИзмененииСервер(ПараметрНапр)
//	
//	СтруктураПоВалюте = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Объект.ДатаКурсаВалюты, Новый Структура("Валюта", Константы.ВалютаУчета.Получить()));
//	
//	КурсВалютыУчета = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Курс);
//	
//	КратностьВалютыУчета = ?(СтруктураПоВалюте.Курс = 0, 1, СтруктураПоВалюте.Кратность);

//	Если ПараметрНапр = "Сумма1" Тогда 
//		Если Объект.НаправлениеКонвертаций = "Конверт_ВалютаУчета_ПроизволнаяВалюта" Тогда 
//			
//			Объект.Сумма2 = 0;
//			Объект.Сумма2 = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
//			Объект.Сумма1,
//			КурсВалютыУчета,
//			Объект.Курс,
//			КратностьВалютыУчета,
//			Объект.Кратность
//			);
//			
//		Иначе 
//			
//			Объект.Сумма2 = 0;
//			Объект.Сумма2 = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
//			Объект.Сумма1,
//			Объект.Курс,
//			КурсВалютыУчета,
//			Объект.Кратность,
//			КратностьВалютыУчета
//			);
//			
//		КонецЕсли;
//	ИначеЕсли ПараметрНапр = "Сумма2" Тогда 
//		Если Объект.НаправлениеКонвертаций = "Конверт_ВалютаУчета_ПроизволнаяВалюта" Тогда 
//			
//			Объект.Сумма1 = 0;
//			Объект.Сумма1 = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
//			Объект.Сумма2,
//			Объект.Курс,
//			КурсВалютыУчета,
//			Объект.Кратность,
//			КратностьВалютыУчета
//			);
//			
//		Иначе 
//			
//			Объект.Сумма1 = 0;
//			Объект.Сумма1 = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(
//			Объект.Сумма2,
//			КурсВалютыУчета,
//			Объект.Курс,
//			КратностьВалютыУчета,
//			Объект.Кратность
//			);
//			
//		КонецЕсли;
//	КонецЕсли;
//	
//КонецПроцедуры

//// Процедура - БанковскийСчет1НачалоВыбораСервер
//&НаСервере
//Процедура БанковскийСчет1НачалоВыбораСервер(ЭлементОтбора)

//	ЭлементОтбора.ПравоеЗначение = Справочники.Организации.ОсновнаяОрганизация;

//КонецПроцедуры // БанковскийСчет1НачалоВыбораСервер()


//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

//// Процедура - УстановытьНаименованиеСчетов1
//&НаКлиенте
//Процедура УстановытьНаименованиеСчетов1()
//	
//	ВалТекст = ПолучитьТекстВалютыБанкСчет1();
//	
//	Элементы.БанковскийСчет1.Заголовок = "Банковский счет" + ВалТекст;
//	Элементы.Сумма1.Заголовок = "Сумма" + ВалТекст;
//	
//КонецПроцедуры // УстановытьНаименованиеСчетов()

//// Процедура - УстановытьНаименованиеСчетов
//&НаКлиенте
//Процедура УстановытьНаименованиеСчетов2()
//	
//	ВалТекст = ПолучитьТекстВалютыБанкСчет2();
//	
//	Элементы.БанковскийСчет2.Заголовок = "Банковский счет" + ВалТекст;
//	Элементы.Сумма2.Заголовок = "Сумма" + ВалТекст;
//	
//КонецПроцедуры // УстановытьНаименованиеСчетов()


//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеНебольшойФирмойСервер.ЗаполнитьШапкуДокумента(
	Объект,
	,
	Параметры.ЗначениеКопирования,
	Параметры.Основание,
	СостояниеДокумента,
	КартинкаСостоянияДокумента,
	РазрешеноПроведение,
	Параметры.ЗначенияЗаполнения
	);
	
	Объект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
	
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДата();
	КонецЕсли;
	
	Объект.ВидОперации       = Перечисления.AzRyВидыОперацийКонвертацияВалюты.КонвертацияВалюты;		
	
	// Если новый объект 
	Если Объект.Ссылка.Пустая() Тогда 	
		
		//Объект.Корреспонденция       = ПланыСчетов.Управленческий.Банк;
		Объект.ТипыКонвертацияВалюты = Перечисления.AzRyТипыКонвертацияВалюты.Безналичные;
		
		Объект.СчетДебетРасход       = Константы.AzRyКонвертацияВалютыСчетДебетРасход.Получить();
		Объект.СчетКредитПриход      = Константы.AzRyКонвертацияВалютыСчетКредитПриход.Получить();
		
	КонецЕсли;
	
	УстановитьТекущуюСтраницу();
	
	//Объект.ВалютаУчета     = Константы.ВалютаУчета.Получить();
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

// Процедура - обработчик события ПослеЗаписи.
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УправлениеНебольшойФирмойКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение);
	
КонецПроцедуры

&НаСервере
// Устанавливает текущую страницу для типа денежных средств.
//
// Параметры:
//	ХозяйственнаяОперация - ПеречислениеСсылка.ХозяйственныеОперации - Хозяйственная операции
//
Процедура УстановитьТекущуюСтраницу()
	
	Если Объект.ТипыКонвертацияВалюты = Перечисления.AzRyТипыКонвертацияВалюты.Безналичные Тогда 
		
		Элементы.БанковскийСчет1.Доступность = Истина;
		Элементы.БанковскийСчет1.Видимость   = Истина;
		Элементы.БанковскийСчет2.Доступность = Истина;
		Элементы.БанковскийСчет2.Видимость   = Истина;

		Элементы.Касса1.Видимость 			 = Ложь;
		Элементы.Касса2.Видимость 			 = Ложь;
		
	ИначеЕсли Объект.ТипыКонвертацияВалюты = Перечисления.AzRyТипыКонвертацияВалюты.Наличные Тогда
		
		Элементы.Касса1.Доступность 	   = Истина;
		Элементы.Касса2.Доступность 	   = Истина;
		Элементы.БанковскийСчет1.Видимость = Ложь;
		Элементы.БанковскийСчет2.Видимость = Ложь;
		Элементы.Касса1.Видимость 		   = Истина;
		Элементы.Касса2.Видимость 		   = Истина;
		
	Иначе
		
		Элементы.БанковскийСчет1.Доступность = Ложь;
		Элементы.БанковскийСчет2.Доступность = Ложь;
		Элементы.Касса1.Доступность 			= Ложь;
		Элементы.Касса2.Доступность 			= Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьТекущуюСтраницу()

&НаКлиенте
Процедура ТипыКонвертацияВалютыПриИзменении(Элемент)
	
	УстановитьТекущуюСтраницу();
	
КонецПроцедуры 

&НаСервере
Процедура ИзменитьКурсыВалют()
	
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	                                                          
	ВалютаУчетаКурс = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ВалютаУчета, Объект.Дата);
	
	Валюта1 = Справочники.Валюты.ПустаяСсылка();
	Валюта2 = Справочники.Валюты.ПустаяСсылка();
	
	Если Объект.ТипыКонвертацияВалюты = Перечисления.AzRyТипыКонвертацияВалюты.Безналичные Тогда 
		Валюта1 = Объект.БанковскийСчет1.ВалютаДенежныхСредств;
		Валюта2 = Объект.БанковскийСчет2.ВалютаДенежныхСредств;
	ИначеЕсли Объект.ТипыКонвертацияВалюты = Перечисления.AzRyТипыКонвертацияВалюты.Безналичные Тогда
		Валюта1 = Объект.Касса1.ВалютаДенежныхСредств;
		Валюта2 = Объект.Касса2.ВалютаДенежныхСредств;
	КонецЕсли;	
	
	ВалютаКурс1 = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта1, Объект.Дата);
	ВалютаКурс2 = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Валюта2, Объект.Дата);
	
	Объект.КурсВалюты1 = ВалютаКурс1.Курс;   
	Объект.КурсВалюты2 = ВалютаКурс2.Курс;
	
КонецПроцедуры // ИзменитьКурсыВалют()

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ИзменитьКурсыВалют();
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчет1ПриИзменении(Элемент)
	ИзменитьКурсыВалют();
КонецПроцедуры

&НаКлиенте
Процедура Касса1ПриИзменении(Элемент)
	ИзменитьКурсыВалют();
КонецПроцедуры

&НаКлиенте
Процедура БанковскийСчет2ПриИзменении(Элемент)
	ИзменитьКурсыВалют();
КонецПроцедуры

&НаКлиенте
Процедура Касса2ПриИзменении(Элемент)
	ИзменитьКурсыВалют();
КонецПроцедуры

//// Процедура - обработчик события ПриОткрытии.
//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	
//	УправлениеВидимостьиРекБанкСчет2();
//	
//	УстановытьНаименованиеСчетов1();
//	УстановытьНаименованиеСчетов2();
//	
//КонецПроцедуры


//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ ОБРАБОТКИ СВОЙСТВ И КАТЕГОРИЙ

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ШАПКИ

//// Процедура - обработчик события ДатаКурсаВалютыПриИзменении.
//&НаКлиенте
//Процедура ДатаКурсаВалютыПриИзменении(Элемент)
//	
//	ДатаКурсаВалютыПриИзмененииСервер();
//		
//КонецПроцедуры

//// Процедура - обработчик события БанковскийСчет1ПриИзменении
//&НаКлиенте
//Процедура БанковскийСчет1ПриИзменении(Элемент)
//	
//	БанковскийСчет1ПриИзмененииСервер1();
//	
//	УстановытьНаименованиеСчетов1();
//	
//	НаправлениеКонвертаций = БанковскийСчет1ПриИзмененииСервер();
//	
//	УправлениеВидимостьиРекБанкСчет2();
//	
//	ОчиститьДатуКурса();
//	
//КонецПроцедуры

//// Процедура - обработчик события БанковскийСчет2ПриИзменении
//&НаКлиенте
//Процедура БанковскийСчет2ПриИзменении(Элемент)
//	
//	БанковскийСчет2ПриИзмененииСервер1();
//	
//	УстановытьНаименованиеСчетов2();
//	
//	НаправлениеКонвертаций = БанковскийСчет2ПриИзмененииСервер();
//	
//	ОчиститьДатуКурса();
//	
//КонецПроцедуры

//// Процедура - обработчик события Сумма1ПриИзменении
//&НаКлиенте
//Процедура Сумма1ПриИзменении(Элемент)
//	
//	//Если Сумма1 = 0 Тогда 
//	//	Возврат;
//	//КонецЕсли;
//	
//	СуммаДокументаПриИзмененииСервер("Сумма1");
//	
//КонецПроцедуры

//// Процедура - обработчик события Сумма2ПриИзменении
//&НаКлиенте
//Процедура Сумма2ПриИзменении(Элемент)
//	СуммаДокументаПриИзмененииСервер("Сумма2");
//КонецПроцедуры

//// Процедура - обработчик события КурсПриИзменении
//&НаКлиенте
//Процедура КурсПриИзменении(Элемент)
//	
//	СуммаДокументаПриИзмененииСервер("Сумма1");
//	СуммаДокументаПриИзмененииСервер("Сумма2");
//	
//КонецПроцедуры

// +++ { AzRy - [26.02.2013] - Jira:ERPM-215 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:ჯირას ტასკის ლინკი 
&НаКлиенте
Процедура AzRyLinkНажатие(Элемент)
	ЗапуститьПриложение(Элементы.AzRyLink.Заголовок);	
КонецПроцедуры

&НаКлиенте
Процедура AzRyПроектыПриИзменении(Элемент)
	AzRyLinkЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура AzRyLinkЗаголовок()
	Элементы.AzRyLink.Заголовок = "https://azrystudio.jira.com/browse/"+ПолучитьКодПроекта()+"-"+Объект.AzRyJiraCode;
КонецПроцедуры 
 
&НаСервере
Функция ПолучитьКодПроекта()	
	Возврат Объект.AzRyПроекты.AzRyJiraProject;
КонецФункции

&НаКлиенте
Процедура AzRyJiraCodeПриИзменении(Элемент)
	AzRyLinkЗаголовок();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	AzRyLinkЗаголовок();
КонецПроцедуры

// +++ } AzRy - [26.02.2013] - Jira:ERPM-215 - Developer:გიორგი მამულაშვილი (George Mamulashvili) - Comment:ჯირას ტასკის ლინკი 



//////////////////////////////////////////////////////////////////////////////////
//// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
